gnhnjac/rehab-game/ESP32/smart_box/smart_box.ino
#include <Wire.h>
#include <Adafruit_PN532.h>
#include <WiFi.h>
#include <esp_now.h>
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
#include "../parameters.h"

Adafruit_PN532 nfc(SDA_PIN, SCL_PIN);

// State variables
bool isRegistered = false;
bool nfcFound = false; // Flag to track if the PN532 was successfully initialized
uint8_t gloveMac[6];
uint8_t myMac[6];

unsigned long last_received_from_glove = 0;
unsigned long last_heartbeat_sent = 0;

// Send callback (Empty, unused)
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
  // Empty
}

// Receive callback
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void OnDataRecv(const esp_now_recv_info_t * recvInfo, const uint8_t *incomingData, int len) {
    const uint8_t *incoming_mac = recvInfo->src_addr;
#else
void OnDataRecv(const uint8_t * incoming_mac, const uint8_t *incomingData, int len) {
#endif
    if (len < sizeof(AppMessage)) return;
    AppMessage msg;
    memcpy(&msg, incomingData, sizeof(AppMessage));

    if (msg.type == MSG_TYPE_ACK) {
        if (!isRegistered) {
            isRegistered = true;
            memcpy(gloveMac, incoming_mac, 6);
            
            // Register Glove as peer
            esp_now_peer_info_t peerInfo;
            memset(&peerInfo, 0, sizeof(peerInfo));
            memcpy(peerInfo.peer_addr, gloveMac, 6);
            peerInfo.channel = 0;
            peerInfo.encrypt = false;

            if (!esp_now_is_peer_exist(gloveMac)) {
                esp_now_add_peer(&peerInfo);
            }
        }
        last_received_from_glove = millis();
    }
    else if (msg.type == MSG_TYPE_HEARTBEAT) {
        if (isRegistered && memcmp(incoming_mac, gloveMac, 6) == 0) {
            last_received_from_glove = millis();
        }
    }
}

void checkHeartbeats() {
  if (!isRegistered) return;

  unsigned long now = millis();

  // 1. Send heartbeat every 1 second
  if (now - last_heartbeat_sent >= 1000) {
    last_heartbeat_sent = now;
    AppMessage heartbeatMsg;
    heartbeatMsg.type = MSG_TYPE_HEARTBEAT;
    memcpy(heartbeatMsg.box_mac, myMac, 6);
    heartbeatMsg.event = EVENT_NONE;
    heartbeatMsg.uid_len = 0;
    memset(heartbeatMsg.uid, 0, MAX_CUBE_UID_LEN);

    esp_now_send(gloveMac, (uint8_t *)&heartbeatMsg, sizeof(heartbeatMsg));
  }

  // 2. Check for Glove timeout (5 seconds)
  if (now - last_received_from_glove > 5000) {
    Serial.println("[Smart Box] Lost connection to Glove (heartbeat timeout). Unregistering...");
    isRegistered = false;
    
    // Delete peer to free resources
    if (esp_now_is_peer_exist(gloveMac)) {
      esp_now_del_peer(gloveMac);
    }
  }
}

void connectToGlove() {
  Serial.println("Searching for Glove...");
  while (!isRegistered) {
    AppMessage regMsg;
    regMsg.type = MSG_TYPE_REGISTER;
    memcpy(regMsg.box_mac, myMac, 6);
    regMsg.event = EVENT_NONE;
    regMsg.uid_len = 0;
    memset(regMsg.uid, 0, MAX_CUBE_UID_LEN);

    uint8_t broadcastMac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    esp_now_send(broadcastMac, (uint8_t *)&regMsg, sizeof(regMsg));
    
    Serial.println("Broadcasting registration request...");
    
    // Wait 2 seconds for background ACK processing
    unsigned long startWait = millis();
    while (millis() - startWait < 2000) {
      if (isRegistered) break;
      delay(50);
    }
  }
  Serial.println("Registered with Glove. Starting active loop...");
  last_received_from_glove = millis();
  last_heartbeat_sent = millis();
}

void sendNfcEvent(CubeEventType event, uint8_t *uid, uint8_t uidLen) {
    if (!isRegistered) return;

    AppMessage msg;
    msg.type = MSG_TYPE_EVENT;
    memcpy(msg.box_mac, myMac, 6);
    msg.event = event;
    msg.uid_len = uidLen;
    memset(msg.uid, 0, MAX_CUBE_UID_LEN);
    if (uid && uidLen > 0) {
        memcpy(msg.uid, uid, uidLen <= MAX_CUBE_UID_LEN ? uidLen : MAX_CUBE_UID_LEN);
    }

    esp_now_send(gloveMac, (uint8_t *)&msg, sizeof(msg));
}

void setup(void) {
  // Disable the brownout detector to prevent power dips from resetting the chip
  //WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);

  Serial.begin(115200);
  delay(1000);
  Serial.println("\n--- [Smart Box] Booting ---");

  // 1. Initialize WiFi first (while PN532 is idle and drawing minimal current)
  Serial.println("Starting WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.macAddress(myMac);
  Serial.print("MAC Address: ");
  for(int i=0; i<6; i++) {
    Serial.printf("%02X", myMac[i]);
    if (i < 5) Serial.print(":");
  }
  Serial.println();

  // 2. Initialize ESP-NOW
  Serial.println("Starting ESP-NOW...");
  if (esp_now_init() != ESP_OK) {
    Serial.println("Error: Failed to initialize ESP-NOW!");
    while (1) delay(100);
  }

  esp_now_register_recv_cb(OnDataRecv);

  // Add broadcast peer for registration
  esp_now_peer_info_t peerInfo;
  memset(&peerInfo, 0, sizeof(peerInfo));
  uint8_t broadcastMac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  memcpy(peerInfo.peer_addr, broadcastMac, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    Serial.println("Error: Failed to add broadcast peer!");
  }

  delay(500); // Let WiFi current draw stabilize

  // 3. Initialize PN532 (staggered to avoid overlapping startup power surges)
  Serial.println("Looking for PN532...");
  nfc.begin();

  uint32_t versiondata = nfc.getFirmwareVersion();
  if (!versiondata) {
    Serial.println("WARNING: Didn't find PN532 board. Check your wiring!");
    Serial.println("Running in Wi-Fi simulation mode (sending mock events)...");
    nfcFound = false;
  } else {
    nfcFound = true;
    Serial.print("Found chip PN532 "); 
    Serial.println((versiondata >> 24) & 0xFF, HEX); 
    Serial.print("Firmware ver. "); 
    Serial.print((versiondata >> 16) & 0xFF, DEC); 
    Serial.print('.'); Serial.println((versiondata >> 8) & 0xFF, DEC);
    nfc.SAMConfig();
  }

  // 4. Dynamic registration
  connectToGlove();
}

void loop(void) {
  if (!isRegistered) {
    connectToGlove();
    return;
  }

  // Handle heartbeat sending and timeout checking
  checkHeartbeats();

  if (nfcFound) {
    uint8_t success;
    uint8_t uid[] = { 0, 0, 0, 0, 0, 0, 0 };  // Buffer to store the returned UID
    uint8_t uidLength;                        // Length of the UID (4 or 7 bytes)

    // Wait for card with a 100ms timeout (non-blocking)
    success = nfc.readPassiveTargetID(PN532_MIFARE_ISO14443A, uid, &uidLength, 100);

    if (success) {
      Serial.println("Card Entered!");
      sendNfcEvent(EVENT_CUBE_ENTERED, uid, uidLength);
      
      // Card is present. Poll it in a loop to detect when it leaves.
      int consecutiveFailures = 0;
      while (consecutiveFailures < 5) {
        checkHeartbeats();
        if (!isRegistered) {
          break; // Lost Glove connection while card is present
        }

        delay(100);
        
        uint8_t pollUid[7];
        uint8_t pollUidLength = 0;
        bool pollSuccess = nfc.readPassiveTargetID(PN532_MIFARE_ISO14443A, pollUid, &pollUidLength, 100);
        
        if (pollSuccess) {
          consecutiveFailures = 0; // Reset counter on successful scan
        } else {
          consecutiveFailures++;   // Increment on failed scan
        }
      }
      
      if (isRegistered) {
        Serial.println("Card Left!");
        sendNfcEvent(EVENT_CUBE_LEFT, uid, uidLength);
      }
    }
  } else {
    // SIMULATED MODE: Send simulated events every 10 seconds, checking heartbeats
    uint8_t simulatedUid[] = { 0x04, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66 };
    uint8_t uidLen = 7;
    
    Serial.println("[Simulated] Cube Entered!");
    sendNfcEvent(EVENT_CUBE_ENTERED, simulatedUid, uidLen);
    
    unsigned long startWait = millis();
    while (millis() - startWait < 5000 && isRegistered) {
      checkHeartbeats();
      delay(50);
    }

    if (isRegistered) {
      Serial.println("[Simulated] Cube Left!");
      sendNfcEvent(EVENT_CUBE_LEFT, simulatedUid, uidLen);
    }

    startWait = millis();
    while (millis() - startWait < 5000 && isRegistered) {
      checkHeartbeats();
      delay(50);
    }
  }
}